fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазницаДат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ДиаграммаГанта/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АдресВХОтпусткаСотрудников") Тогда
		Адрес = Параметры.АдресВХОтпусткаСотрудников;
		ДатаДокумента = Параметры.ДатаДокумента;
	КонецЕсли;

	ТаблицаЗначений = ПолучитьИзВременногоХранилища(Адрес);
	
	СформироватьГрафикОтпусков(ТаблицаЗначений, ДатаДокумента);
	

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьГрафикОтпусков(ТаблицаЗначений, ДатаДокумента)

	НачалоГода = НачалоГода(ДатаДокумента);
	КонецГода = КонецГода(ДатаДокумента);

	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();

	Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");

	Для Каждого Строка Из ТаблицаЗначений Цикл

		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Если Строка.ДатаНачала >= НачалоГода И Строка.ДатаОкончания <= КонецГода Тогда
			Интервал.Начало = Строка.ДатаНачала;
			Интервал.Конец = Строка.ДатаОкончания;
		КонецЕсли;

		Шкала = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы[0];
		Шкала.Метки.Очистить();


	КонецЦикла;

КонецПроцедуры
#КонецОбласти
